Revit 2026 API

# ContourSettingItem Properties

---

The ContourSettingItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Start | The contour range start elevation. |
|  | Step | The increment elevation of the contour range. |
|  | Stop | The contour range stop elevation. |
|  | SubCategoryId | The contour line style subcategory id. |
|  | Type | The contour setting item type. |

#### Reference

ContourSettingItem Class

Autodesk.Revit.DB Namespace